# ==============================================================================
# TAP
# ==============================================================================

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# ==============================================================================
# BREW
# ==============================================================================

# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# General-purpose scripting language
brew "php"
# Highly capable, feature-rich programming language
brew "perl"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extensible IRC client
brew "weechat"

# ==============================================================================
# CASK
# ==============================================================================

# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source BitTorrent client
cask "transmission"
# Multimedia player
cask "vlc"
# Google Chrome Web Browser
cask "google-chrome"
# Web security testing toolkit
cask "burp-suite"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Open source Code Editor
cask "visual-studio-code"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Open-source software for live streaming and screen recording
cask "obs"
# Native desktop client for WhatsApp
cask "whatsapp"


vscode "daltonmenezes.aura-theme"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jakebecker.elixir-ls"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "sumneko.lua"
vscode "usernamehw.errorlens"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
