# ==============================================================================
# TAP
# ==============================================================================
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# ==============================================================================
# BREW
# ==============================================================================
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# General-purpose scripting language
brew "php"
# Highly capable, feature-rich programming language
brew "perl"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extensible IRC client
brew "weechat"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Create, run, and share large language models (LLMs)
brew "ollama"
# OpenAI's coding agent that runs in your terminal
brew "codex"

# ==============================================================================
# CASK
# ==============================================================================
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Open-source BitTorrent client
cask "transmission"
# Multimedia player
cask "vlc"
# Google Chrome Web Browser
cask "google-chrome"
# Web security testing toolkit
cask "burp-suite"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Open source Code Editor
cask "visual-studio-code"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Open-source software for live streaming and screen recording
cask "obs"
# Native desktop client for WhatsApp
cask "whatsapp"
# Free cross-platform office suite, fresh version
cask "libreoffice"