# ==============================================================================
# BREW
# ==============================================================================
# Distributed revision control system
brew "git"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# General-purpose scripting language
brew "php"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Highly capable, feature-rich programming language
brew "perl"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Create, run, and share large language models (LLMs)
brew "ollama"

# ==============================================================================
# CASK
# ==============================================================================
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Monospace programming font with ligatures
cask "font-fira-code"
# Open-source BitTorrent client
cask "transmission"
# Multimedia player
cask "vlc"
# Chromium-based web browser
cask "helium-browser"
# Web browser
cask "google-chrome"
# Multi-platform web browser
cask "microsoft-edge"
# Web security testing toolkit
cask "burp-suite"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Open-source software for live streaming and screen recording
cask "obs"
# Native desktop client for WhatsApp
cask "whatsapp"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Anthropic's official Claude AI desktop app
cask "claude"
# Terminal-based AI coding assistant
cask "claude-code"
