daltonmenezes.aura-theme
dbaeumer.vscode-eslint
docker.docker
esbenp.prettier-vscode
github.vscode-pull-request-github
golang.go
humao.rest-client
hverlin.mise-vscode
jakebecker.elixir-ls
mechatroner.rainbow-csv
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
pkief.material-icon-theme
qwtel.sqlite-viewer
redhat.java
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-portuguese-brazilian
sumneko.lua
tamasfe.even-better-toml
usernamehw.errorlens
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
